{
  "basics": {
    "name": "Chinedum Ukejianya",
    "label": "Software Developer",
    "picture": "https://i.imgur.com/mletEEX.png",
    "email": "cukejianya@gmail.com",
    "phone": "",
    "website": "www.cukejianya.com",
    "summary": "Chinedum holds a Bachelors Degree in Physical Science with a concentration in Mathematics, Physics, and Computer Science. Though Chinedum spent a measurable amount of time programming through Role Playing Game Maker 2003, a gaming software tool, his first true introduction to computer science was through a Hack-a-thon. From that point on, Chinedum has enjoyed problem solving various programming obstacles and creating mini side projects.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Baltimore",
      "countryCode": "US",
      "region": "Baltimore, Maryland"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "ukejianya_",
        "url": "https://twitter.com/cukejianya_"
      },
      {
        "network": "Github",
        "username": "cukejianya",
        "url": "https://github.com/cukejianya"
      },
      {
        "network": "LinkedIn",
        "username": "cukejianya",
        "url": "https://www.linkedin.com/in/cukejianya/"
      },
      {
        "network": "Medium",
        "username": "cukejianya",
        "url": "https://medium.com/@cukejianya"
      },
      {
        "network": "Instagram",
        "username": "cukejianya",
        "url": "https://www.instagram.com/cukejianya/"
      }
    ]
  },
  "work": [
    {
      "company": "Helm",
      "position": "Full Stack Engineer",
      "website": "",
      "startDate": "2019-10-18",
      "endDate": "present",
      "summary": "",
      "highlights": [
        "Worked with GraphQL and Ruby on Rails to migrate a database from Google Cloud Datastore",
        "Worked with Java, Maven, and Google Cloud Platform to service more than 30,000 people simantaneously on both a web and mobile apps",
        "Improved and refactor a integration PHP codebase connected to the Iterable.com API",
        "Helped greenfield a new project using AngularJS 9 and Ngrx",
        "Architeched and built an Admin Service for both BE and FE using Python, AWS Lambda Functions, Angular 11, MongoDB, and Auth0 API",
        "Helped transition our backend into our new stack which consisted of Graphql, nodejs, trypescript, AWS CDK, and postgress"
      ]
    },
    {
      "company": "SocialCode",
      "position": "Software Developer (Full Stack)",
      "website": "",
      "startDate": "2016-04-24",
      "endDate": "2018-06-06",
      "summary": " SocialCode enables smarter, more profitable brands. Our media and analytics capabilities empower marketers to understand, manage and reach their audiences across social, mobile and video platforms.",
      "highlights": [
        "Worked with Django and python 2.7/3.5 on the backend to interact with the pinterest and snapchat social media ads api",
        "Made the activation app faster and more responsive by transitioning our BackboneJS components to EmberJS",
        "Deployed and worked on multiple micro-services using Agile Methods and technologies such as chef, jenkins, aws (RDS and EC2), sentry, and git",
        "Helped shaped Snapchats and Pinterest Ad APIs by testing the APIs, documenting inconsistencies, and sharing my findinds with the respective social media's developer ad teams",
        "Led projects that added features to our activation app which created an increase in productivity with our internal Ad Managers Sales Team"
      ]
    },
    {
      "company": "Trove News",
      "position": "Backend Developer",
      "website": "",
      "startDate": "2015-05-22",
      "endDate": "2015-08-22",
      "summary": "A news reader app that aims to build on the understanding of how people consume news, giving users stories picked by other people who share their interests. ",
      "highlights": [
        "Converted a bookmarklet into a google chrome extension",
        "Helped to incorporate NPR podcasts in \"troves\" during a in house hack-a-thon",
        "Worked primarily with Python, Pyramid (ORM), and Mako."
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "University of Maryland, College Park",
      "area": "Physical Science [concentration in Mathematics, Physics, and Computer Science]",
      "studyType": "Bachelor",
      "endDate": "2017-05-01",
      "gpa": "",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [],
  "languages": [
    {
      "language": "Javascript",
      "fluency": "Experience"
    },
    {
      "language": "NodeJS",
      "fluency": "Experience"
    },
    {
      "language": "Python",
      "fluency": "Experience"
    },
    {
      "language": "AngularJS",
      "fluency": "Intermediate"
    },
    {
      "language": "ReactJS",
      "fluency": "Intermediate"
    },
    {
      "language": "GraphQL",
      "fluency": "Intermediate"
    },
    {
      "language": "AWS",
      "fluency": "Beginner"
    }
  ],
  "interests": [],
  "references": []
}
